{
  "projects": [
    {
      "id": "pomodoro-timer",
      "title": "Pomodoro Timer",
      "category": "Proyecto Personal",
      "description": "Aplicación de productividad con ciclos altamente personalizables y testing automatizado E2E. Enfocada en la prevención del agotamiento.",
      "fullDescription": "## El Reto\nCrear una herramienta de gestión de tiempo que fuera más flexible que los temporizadores estándar, permitiendo a los usuarios adaptar la técnica Pomodoro a sus propios ritmos biológicos y de concentración.\n\n## La Solución\nDesarrollé una SPA (Single Page Application) que permite una personalización granular de los tiempos de enfoque y descanso. La aplicación gestiona estados complejos para asegurar que el usuario no rompa la consistencia de la técnica.\n\n### Funcionalidades Clave\n- **Personalización Avanzada:** Configuración de ciclos de 1 a 60 minutos y límites de repeticiones.\n- **Prevención de Errores:** Sistema de bloqueo de configuración durante la ejecución (UX defensiva).\n- **Feedback Auditivo y Visual:** Indicadores de progreso circular y notificaciones sonoras sutiles.\n- **Modo Autoplay:** Para usuarios que buscan un flujo de trabajo ininterrumpido.\n\n### Calidad y Testing\nPara garantizar la estabilidad, implementé pruebas E2E con **Cypress**, asegurando que los flujos críticos (inicio, pausa, reinicio y cambio de ciclo) funcionen perfectamente en cada deploy.",
      "tags": [
        "React",
        "Vite",
        "Cypress",
        "Sass",
        "Bootstrap"
      ],
      "image": "assets/images/projects/pomodoro-cover.png",
      "links": {
        "demo": "https://frani-be.github.io/neuralclocks-pomodoro/",
        "repo": "https://github.com/frani-be/neuralclocks-pomodoro/"
      },
      "featured": true,
      "client": "Proyecto Personal",
      "date": "2024",
      "role": "Frontend Engineer",
      "stack": "React, Vite, Cypress"
    },
    {
      "id": "logofolio-collection",
      "title": "Logofolio & Brand Identity",
      "category": "Visual Design",
      "description": "Selección de identidades visuales y logotipos creados para startups y marcas personales. Síntesis gráfica y comunicación visual.",
      "fullDescription": "## Identidad Visual\nEl diseño de una marca requiere capacidad de síntesis y entendimiento profundo de los valores del cliente. A continuación presento una colección de logotipos desarrollados para diversos sectores.\n\n### Ejemplos de la colección 2015-2025\n\n::: showcase\n![Liquida Solutions](assets/images/projects/logos/liquida-solutions.png)\n*Identidad visual para soluciones digitales. La geometría circular y las ondas representan adaptabilidad y flujo constante.*\n:::\n\n::: showcase\n![Orquesta USM](assets/images/projects/logos/orquesta-usm.png)\n*Identidad que equilibra el prestigio institucional con la sensibilidad artística. Uso de tipografía serif y tonos vino para denotar elegancia y tradición cultural.*\n:::\n\n::: showcase\n![Cure All](assets/images/projects/logos/cure-all.png)\n*Branding para HealthTech centrado en la empatía. La unión fluida entre corazón y estetoscopio, junto a tonos menta, reduce la fricción clínica y genera confianza.*\n:::\n\n### Herramientas\nTodo el trabajo vectorial ha sido realizado en **Adobe Illustrator**, priorizando la legibilidad en tamaños reducidos y la versatilidad de aplicaciones (monocromo, negativo, etc.).",
      "tags": [
        "Adobe Illustrator",
        "Branding",
        "Vector Art",
        "Graphic Design"
      ],
      "image": "assets/images/projects/logofolio-cover.png",
      "links": {
        "demo": "",
        "repo": "",
        "caseStudy": ""
      },
      "featured": false,
      "client": "Varios Clientes",
      "date": "2015 - 2025",
      "role": "Visual Designer",
      "stack": "Adobe Illustrator"
    }
  ]
}